[{"Heading": " SUMMARY ", "Content": ["This report covers a total of 45 sub-blocks which have been relinquished effective 15", "February 1996, from three tenements.", "13 sub-blocks from EPM 8662 Fernhill", "18 sub-blocks from EPM 8688 Frasers Well and", "14 sub-blocks from EPM 8734 Percyvale", "The tenements were explored for Broken Hill Type (BHT) Pb-Zn-Ag mineralisation.", "Work completed on the relinquished areas includes:", "1) Acquisition of aeromagnetic data and stream sediment geochemistry from Kidston", "Gold Mines", "2) Interpretation of factual geology and aeromagnetics", "3) Airborne 75Hz GEOTEM survey", "4) Reconnaissance follow-up of GEOTEM anomalies", "5) Ground magnetics and ground EM", "6) Rock-chip sampling", "7) Soil sampling", "8) Stream sediment sampling", "9) RC drilling", "The work conducted within the relinquished areas has been sufficient to preclude the", "presence of a significant BHT system However, several small BHT prospects were", "discovered during the four years of tenure. Most are characterised by gossanous", "quartz-gahnite units with limited strike extent. Of these, the Camerons and Smirkies", "prospects are probably the most interesting.", "Drilling of magnetic features under Mesozoic cover has been successful in resolving", "the gross stratigraphic and structural setting of the area, but failed to intersect", "alteration or mineralisation typical of a BHT system.", "Follow-up of GEOTEM anomalies was also disappointing and most anomalies relate", "to very small pods of sulphide mineralisation (ie. GEOTEM anomalies 3-5, 10 and", "11). The potential for a BHP sized Pb-Zn-Ag ore body is very limited, hence the", "relinquishments."]}, {"Heading": "1. INTRODUCTION 1.0", "Content": ["EPMs 8662 \"Fernhill\", 8688 \"Frasers Well\" and 8734 \"Percyvale\" are adjoining", "tenements and are located approximately 80 km south east of Georgetown and 55 km", "south west of Einasleigh in North Queensland (Figure 1).", "This tenement grouping covers the outcropping Einasleigh Metamorphics and its", "extension under cover, in particular, the calc-silicate-leucogneiss-biotite gneiss (Pe,-", "Pez-Pe3) transition. The Einasleigh Metamorphics are known to host numerous, albeit", "small, base and precious metal deposits. The intimate association of base metal", "mineralisation and proximity to the Pe,-Pe,-Pe3 transition is used as a discriminant for", "exploration.", "The tenements were aquired to explore for Broken Hill - Cannington type Pb-Zn-Ag", "mineralisation.", "This report details work carried out over the tenements up until the period ending 15", "February 1996."]}, {"Heading": "2. TENEMENT DETAILS 1.0", "Content": ["2.1 \tEPM 8662 Fernhill", "EPM 8662 Fernhill was granted to BHP Minerals Ltd on 13 February 1992 for a", "period of two years covering 52 sub-blocks. Twenty-six (26) sub-blocks were", "relinquished effective 13 February 1994, with a further thirteen (13) sub-blocks being", "relinquished effective 13 February 1995.", "The final 13 sub-blocks listed below were surrendered effective 17 January 1996.", "NORMANTON BLOCK IDENTIFICATION MAP", "SERIES B", "Block Sub-block", "2591 \tS X", "2592 \tImnqv n V", "2663 \tekp k", "2664 \ta f", "Total: \t13 sub-blocks", "2.2 EPM 8688 Frasers Well", "EPM 8688 Frasers Well was granted to BHP Minerals Ltd on 17 March 1992 for a", "period of two years covering 51 sub-blocks. The tenement was reduced by 4", "143'00 \t143%30 \t144'00", "16100,000 SHEET", "FOREST HOME", "G \tMount", "Surprise", "\"Forest Home\"", "SIBERD \tGeorgetbwn", "GEORGETOWN \tMOUNT SURPRISE", "FORSAYTH \tC \t18%30' \tEinasleigh \tEINASLEIGH", "o \tForsayth", "\"Carpegtaria", "Downs", "EPM 8688", "Area relinquished", "\"North Head\"", "Frasers Well", "on 17 January 1996", "Robinhood \t(13 sub-blocks)", "Area relinquished", "on 15 February 1996", "(19 sub-blocks) \tL", "NORTH HEAD", "BELLFIELD \tArea relinquished \t19\"00\"", "on 18 March 1996 \tDO", "EPM 8662", "(14 sub-blocks) \tFernhill", "EPM 8734", "Percyvale", "\"Gilberton\" \t\"Oak Park\"", "\"Bellfield\"", "GILBERTON \tLYNDHURST", "CR \t2", "Scale 1 1,000,000", "0 \t10 \t20 \t30 \t40 \t50 km", "I", "Cairns", "LAMBERT CONFORMAL CONIO PROJECTION", "STANDARD PARALLELS 16940\" & 19'20", "MAP", "AREA \tJTownsville", "o Mt isa \tMackay \tArea to be retained", "Rockhampton", "Map information digitised from", "1:1,000,000 IMW sheets", "BRISBANE", "NORMANTON AND TOWNSVILLE", "LOCATION MAP \tMicrostation", "Prepared P.Gregory \tBHP Minerals", "A.C.N. 008 694 782", "Centre Brisbane", "Drawn D.Robbins \tA4-1219", "Date : March, 1994", "EPM 8662 8688 AND 8734, NORTH QUEENSLAND", "Revised - 5/96", "LOCATION MAP \tFIGURE 1", "sub-blocks on 17 March 1994. A further 25 sub-blocks were relinquished effective 14", "February 1995 and 9 sub-blocks were relinquished effective 15 February, 1996.", "The relinquished sub-blocks are as follows:", "NORMANTON BLOCK IDENTIFICATION MAP", "SERIES B", "Block Sub-block", "2517 \tZ", "2518 \tqrstuvwxy", "2590 \tabedeghjk", "Total: \t19 sub-blocks", "The current tenement holding is as follows:", "2510 Z", "2519 V W", "2.3 \tEPM 8734 Percyvale", "EPM 8734 Percyvale was granted to BHP Minerals Ltd on 14 April 1992 for a period", "of two years covering 33 sub-blocks. Five sub-blocks were relinquished effective 14", "April 1994 and a further 14 sub-blocks were relinquished effective 14 April 1995, the", "remaining sub-blocks were surrendered effective 18 March 1996.", "The surrendered sub-blocks are as follows:-", "NORMANTON BLOCK IDENTIFICATION MAP", "SERIES B", "Block Sub-block", "2590 \topu p", "2591 \tlgrvw", "2662 \tp", "2663 \ta d fj 1", "Total: \t14 sub-blocks"]}, {"Heading": "3. GEOLOGY 2.0", "Content": ["The Einasleigh Metamorphics in the Fernhill-Percyvale-Frasers Well area was", "previously mapped and interpreted by the BMR (Withnall, 1984) to be dominated by", "biotite gneiss and was therefore denoted as Pe3, the youngest of the three Einasleigh", "Metamorphic subdivisions (Plate 1).", "The overall metamorphic stratigraphy of the area is now interpreted by BHP to consist", "of three main units, (1) a thick basal (?) calc-silicate dominated unit (equivalent to", "Pe,), (2) a thin iron-rich \"leucogneiss\" unit (equivalent to Pe,) and a thick uppermost", "(?) unit dominated by biotite gneiss (equivalent to Pe3) (See Plate 2).", "The calc-silicate (or Pe unit) is a thick (>1km) sequence dominated by a banded", "quartz-plagioclase-clinopyroxene-hornblende (meta-sediment + metavolcanic) gneiss.", "Minor interbeds of quartz-feldspar-biotite gneiss (or simply \"biotite gneiss\") occur", "throughout this unit, particularly toward the upper (or western-most) part of the unit.", "The calc-silicate unit is variably magnetic with a characteristic mottled moderately", "magnetic pattern.", "The \"leucogneiss\" (or Pe, unit) usually occurs within or in close proximity to the Pe,-", "Pe3 transition. This relatively thin unit varies in thickness from 10's of metres to", "100's of meters locally. It may also form thin interbeds to 5cm thickness within", "biotite gneiss. In most places it is a fine to medium-grained equigranular quartz-", "plagioclase (+ pyrite + magnetite + chalcopyrite) rock. Locally it can be medium to", "coarse-grained and granitic in texture. The precursor to this rock is uncertain. It may", "be an acid volcanic rock or alternatively a sedimentary rock derived from acid", "volcanic detritus. It is generally highly ferruginous with abundant disseminated", "magnetite and/or pyrite.", "The leucogneiss is usually semi-continuous and traceable for several km along strike,", "though it appears to be structurally dismembered. It is not certain how many discrete", "Pe, horizons exist, but there appears to be only one major horizon with one or two", "possible thinner bands with limited strike.", "The magnetite-bearing leucogneiss is the most consistently magnetic of all the rock", "types present in the region It forms characteristic high intensity magnetic linears", "which serve as excellent \"markers\" in the magnetic stratigraphy.", "The \"biotite gneiss\" (or Pe3 unit) is a thick (>1km) sequence of pelitic to psammo-", "pelitic metasediments overlying the Pe and Pe, units. The dominant lithology is a", "quartz-feldspar-biotite gneiss with abundant migmatites. Minor to subordinate", "pegmatite, quartzite, calc-silicate and amphibolite also occur within this sequence.", "The transition between Pe, and Pe is locally gradationa (over <100 metres)", "The biotite gneiss unit is generally non-magnetic resulting in a magnetically \"quiet", "zone\" on the aeromagnetic image Traces of magnetite do occur locally, particularly", "within thin quartzite bands. This characteristic is in stark contrast to the magnetic Pe,", "and strongly magnetic Pe, units.", "All BHT mineralisation within the Percyvale area is hosted within the biotite gneiss", "(Pe3), proximal to the contact with Pe2, or where absent, the calc-silicate gneiss", "(Pe1) No significant mineralisation was found within the relinquished areas,", "although at several localities, quartz-gahnite units with small gossanous pods were", "located. These are shown on Plate 1 and the most significant prospects were", "Camerons, Smirkies and GEOTEM anomalies 3-5 (MeCaughey, 1995, Stephens and", "Paish, 1995)."]}, {"Heading": "4. PAST EXPLORATION 4.0", "Content": ["Previous explorers in the region have concentrated their efforts on gold and uranium", "mineralisation with little attention on base metals. Many companies had the Kidston-", "style sub volcanic gold mineralisation as an exploration target. Companies which", "actively sought base metals did not document their strategy for their target style.", "Mt Veteran Minerals met with success in delineation of a large Cu-Pb-Zn anomaly in", "stream sediments. Values range up to 270ppm Cu, 750 ppm Zn and 110ppm Pb.", "They called the anomaly the \"Black Soil Creek\" anomaly. This anomaly lies in a", "joint venture tenement held by Kidston Gold Mines and BHP Minerals Pty Ltd.", "The Black Soil Creek Anomaly is, by far, the strongest geochemical indication of base", "metal mineralisation, hosted by Einasleigh Metamorphics, in the region.", "During their evaluation of porphyry dyke related gold Central Murchison Gold", "delineated a sequence of weakly anomalous (Cu/Pb) pyritic leucogneisses in their", "Camerons Prospect (Plate 1). Although not geochemically important these pyritic", "leucogneisses give some information as to the stratigraphic position within the", "Einasleigh Metamorphics They are thought to be the equivalent of Pe,."]}, {"Heading": "5. EXPLORATION CONDUCTED 4.0", "Content": ["5.1 Introduction", "Work completed on the relinquished areas includes:", "Acquisition of aeromagnetic data and stream sediment geochemical data from", "Kidston Gold Mines", "Interpretation of factual geology and aeromagnetics", "Airborne GEOTEM survey", "Reconnaissance follow-up of GEOTEM anomalies", "Ground magnetics over GEOTEM anomalies and aeromagnetic trends", "Ground EM (moving and fixed loop) over GEOTEM anomalies", "Rock-chip sampling (over GEOTEM anomalies, aeromagnetic linears and", "following up stream anomalies).", "Soil sampling", "Stream sediment sampling", "Drilling of aeromagnetic and GEOTEM anomalies", "Throughout the life of these EPMs field work has been supervised by P. Gregory, I.", "Sandl, D. Stephens, G. McLatchie and S. MeCaughey. Geophysical modelling was", "undertaken by D.Price, R.Scott and M.Kay.", "Field personnel and logistics were co-ordinated by N.O'Loughlin. All geochemical", "analyses were performed by Analabs in Townsville.", "5.2 Geology", "The area relinquished to the north is dominated by Mesozoic sandstone/siltstone", "lithologies unconformably overlying Proterozoic metasediments of the Einalsleigh", "Metamorphics and younger granites. The metasediments are thought to belong to the", "Pe3 unit of the Einasleigh Metamorphics.", "The area to the east (EPM 8662 Fernhill) is dominated by outcropping Einasleigh", "Metamorphics as is the area to the south (EPM 8688 Percyvale) (Plate 1).", "5.3 Geochemistry", "5.3.1 Stream Sediment Geochemistry", "In addition to the regional stream sediment geochemical data acquired from Kidston", "Gold Mines (KGM), BHP undertook a program of regional follow-up and infill", "sampling.", "Approximaely 80 -80# samples (200g) were collected within the areas being", "relinquished, and analysed for Cu, Zn, Pb, Ag, As, Fe, Mn, and Au. A selection of", "samples were also analysed for Mg.", "Stream sediment sample locations and geochemical results for Cu, Pb and Zn are", "shown on Plate 3 and listed in Appendix 1.", "Follow-up of weak Cu/Zn anomalism on the western edge of the Frasers Well EPM", "lead to the discovery of the Smirkies Prospect, a small gossan of limited strike with", "minor associated quartz-gahnite pods, garnet quartzites and limited host rock", "alteration (garnet-sillimanite development). Weak-moderate Pb/Zn anomalism within", "Carpentaria Gully was also followed up in detail. Small pieces of gossanous quartz-", "gahnite float were located, although an outcropping source was not located. No", "significant GEOTEM anomalies occur within the anomalous drainage catchments.", "5.3.2 Rock chip sampling", "Rock chip samples have been collected from the relinquished portions of the EPM's", "during regional mapping, reconnaissance follow-up of magnetic, GEOTEM stream", "geochemical anomalies.", "Several samples returned anomalous results including:", "ELR 39 Qtz-gahnite-mica-feldsparr metapsammite (342 ppm Pb, 265 ppm Zn)", "PCR 63 \tIron stained quartz-feldspar-magnetite leucogneiss (217 ppm Pb, 231 ppm Zn)", "PCR 99 Gossanous quartz-gahnite rock (639 ppm Zn)", "ELR 41 Limonite-haematite bearing gossan (2953 ppm Cu)", "PCR 105 Gossan with malachite-azurite (1.23% Cu, 254 ppm Pb 1.63g/t Au)", "PCR 138 Siliceous, sulphidic gossan (1510 ppm Cu, 1.23% Pb, 1.26% Zn 1.9 ppm Ag)", "PCR 243 Garnet bearing calc-silicate (2672 ppm Zn)", "PCR 330 Gahnite bearing micaceous arenite (3880 ppm Zn, 1.6 ppm Ag)", "PCR 335 Gossan (Smirkies Prospect) (550 ppm Cu, 2.21% Pb, 0.27% Zn and 18.7 ppm Ag)", "PCR 709 Gossanous metasediment (979 ppm Cu, 1.07% Pb, 0.25 % Zn and 16 ppm Ag)", "The locations of all rock chip samples are presented on Plate 4, while the analytical", "results and lithological descriptions for samples taken this field season are listed in", "Appendix 2.", "5.3.3 Soil Sampling", "Portions of three regional soil lines fall within the relinquished areas (Plate 4) These", "soil lines were sampled following some encouraging results from regional mapping", "and rock chip sampling. The three regional soil lines are-approximately 1.5kms apart", "and trend in a NE direction. A total of 191 samples were collected within the", "relinquished areas. These samples were -2mm samples taken at 50m intervals. The", "samples were analysed for Cu, Zn, Pb, Ag, As, Fe, Mn and Au. A selection of", "samples were also analysed for Mg", "The soil geochemical results are presented on Plate 4, and in Appendix 3.", "In addition to these samples collected during 1992, soil sampling was also conducted", "over GEOTEM anomalies 1, 6, 7, 10 and 11 (Plate 6). The latter two anomalies relate", "to the Camerons prospect.", "Camerons", "111 soil samples were collected within the Camerons prospect (66 samples over", "GEOTEM anomaly 10 and 45 over GEOTEM anomaly 11) (Plate 5) At each sample", "location, approximately 50 grams of -80# B horizon soil was collected and analysed", "for Cu, Pb, Zn, Mn, Fe and Ag by Analabs, Townsville (lab method GI-142)", "Appendix 3.", "The results highlighted an area on the western line where elevated Zn and Pb (up to", "386 ppm Pb and 1890 ppm Zn) occurred over a length of 150m. Subsequent", "geological mapping in this area has shown that this anomaly corresponds with a small", "area of scattered gossanous boulders. The fact that this small area of gossan occurs on", "the side of a steep hill suggests that the larger soil anomaly is reflecting a degree of", "downhill dispersion.", "Rock chip samples taken from the gossanous scree have returned up to 1510 ppm Cu,", "1.23% Pb, 1.26% Zn and 2g/t Ag (Plate 4 and Appendix 2). Spotty garnet-sillimanite", "alteration occurs adjacent to the gossanous area however, the mapping and soil", "sampling indicates that the mineralisation/alteration has a very limited strike extent.", "In view of the above, no further work was deemed necessary within the Camerons", "area.", "GEOTEM anomaly 1", "GEOTEM anomaly 1 is a 2nd order priority anomaly located about 3 km south of the", "Percyvale homestead. It was field checked during 1994 and nothing of interest was", "found. However, field checking of GEOTEM conductors to the north located small", "amounts of gossanous float believed to be a possible extension to the Black Soil", "system (McCaughey et al., 1994). It was therefore decided to conduct a small", "program of grid-based soil sampling over the interpreted centre of this GEOTEM", "anomaly, to test for further, poorly exposed continuations of the extensive Black Soil", "system.", "A total of 67 samples was collected from three east-west trending lines with samples", "of sieved (-80#) B horizon soils collected every 50m. The samples were analysed for", "Cu, Pb, Zn, Ag and Mn by Analabs, Townsville (lab method GI 142). The locations", "of the samples are shown on Plate 4.", "The results of the sampling were disappointing and no anomalous results were", "recorded. The sampling has indicated that the Black Soil system does not extend into", "the immediate area. Previous geological traversing had suggested that the anomaly is", "related to a large fault zone which separates Palaeozoic granite from Proterozoic", "basement. This idea is now favoured again.", "GEOTEM anomalies 6 and 7", "39 soil samples were collected along outeropping/subcropping portions of the EM", "grids at GEOTEM anomalies 6 and 7 (Plate 6).", "Each sample (-80#) was analysed for Cu, Pb, Zn, Ag, Fe and Mn by Analabs,", "Townsville. The locations of the samples is presented on Plate 4 while the analyical", "data is presented in Appendix 3.", "No geochemically anomalous samples were returned although in places significant", "colluvium shedding from the nearby Mesozioc plateaus would have severely diluted", "the bedrock signature.", "5.4 GEOPHYSICS", "5.4.1 Acquisition of Aeromagnetie Data", "Soon after the Frasers Well, Fernhill and Percyvale tenements were granted in early", "1992, Placer were approached regarding the purchase or swapping of aeromagnetic", "data over the Percyvale area. Placer (Kidston Gold Mines) had flown a survey over", "this area in 1989 and agreed to exchange part of this data for an equivalent amount of", "BHP's data from another area. The specification details of Placer's Gilberton North", "survey area given in Table 1.", "CR \t#", "2", "TABLE 1", "GILBERTON NORTH AEROMAGNETIC SURVEY", "SPECIFICATION DETAILS", "Name and state of survey \tGILBERTON NORTH, QLD", "AMG 250000 sheet name \tSE54-16", "Contractor \tAUSTIREX for Kidston Gold", "Data supplied by Pacer", "Date of data acquisition \tAugust-October 1989", "Nominal flight line spacing: \t200.00", "Flight line bearing (deg) \t-89.10", "Nominal terrain clearance (m) \t180.0", "Type of path recovery used \tVisual flight strips", "Magnetometer \tScintrex V2321 ALKALI VAPOUR", "Spectrometer \tGeometrics GR8OOD", "Spectrometer crystal size \t33.00", "Magnetic reading interval (secs) \t0.20", "Magnetic sampling distance (m) \t14.00", "Radiometric reading interval (secs) \t1.00", "Radiometric sampling distance (m) \t70.00", "Nominal speed (m/sec) \t70.00", "Compton stripping alpha ratio \t0.33", "Compton stripping beta ratio \t0.34", "Compton stripping gamma ratio \t0.93", "Minimum longitude of survey \t143.26.53E", "Maximum latitude of survey \t144.01.45E", "Minimum longitude of survey \t019.05.49S", "Maximum latitude of survey \t018.37.30S", "Total line kms of survey (mxm) \t11563.19", "Map projection name \tAMG54", "Compiled by A Rossback February 1992", "5.4.2 Ground Magnetic Traverses", "Two phases of ground magnetics were read on areas currently being relinquished. The", "first phase (in October 1992) involved the recovery and definition of four high intensity", "aeromagnetic anomalies (F,G, I and J) identified from the Gilberton North aeromagnetic", "survey flown in August 1989 (Plate 7). The aim of the ground magnetics was to", "determine, via computer modelling, the approximate depths to each of the magnetic", "bodies and to identify which of the anomalies were suitable for drill testing (Appendix", "4).", "Four of the seven magnetic anomalies which lie within the relinquished areas were", "subsequently chosen for drill testing (Plate 7).", "The second phase of ground magnetics involved reading magnetics over conductive", "bodies identified by the GEOTEM survey flown in mid 1993. The magnetics were read", "to assist with drill hole planning and prioritising GEOTEM anomalies. Ground", "magnetics were read over the GEOTEM anomalies and contours of these data are", "included in MeCaughey, 1995.", "5.4.3 Airborne GEOTEM survey", "A regional airborne GEOTEM survey was flown mid 1993 to delineate possible", "sulphide accumulations hosted by the Einasleigh Metamorphics The survey utilised a", "GEOTEM II 75 Hz/2msec system and was flown at a 300m line spacing. The survey", "overlap with the relinquished area is shown on Plate 6. Specifications for the survey are", "detailed in Table 2.", "24 anomalies were defined within the relinquished areas, and given a priority rating", "depending on the strength of the anomaly (Plate 6). Seven of the twenty-four GEOTEM", "anomalies had ground work conducted over them including ground magneties, and", "ground EM (both moving and fixed loop EM).", "2", "5.4.4 Ground EM", "In 1994, ground EM, including moving and fixed loop, was conducted over GEOTEM", "anomalies 3,4,5,6,7,10 and 13 (Table 3) (MeCaughey, 1995). The results of the ground", "EM were modelled in conjunction with ground magnetic data to plan subsequent drill", "testing (Appendix 5).", "TABLE 3", "Ground EM completed 1994", "Survey Area \tNo. line kms \tNo. line kms fixed \tGround magneties", "moving loop \tloop", "Geotem Anomaly", "3,4,5 \t2.8 \t2.8", "6 \t3 \t- \t3", "7 \t3 \t- \t3", "10 \t5.0 \t0.9 \t3", "13", "TABLE 2", "SPECIFICATIONS OF GEOTEM SURVEY \t7972 \t7 \t2", "Specification \tValue", "Aircraft \tCASA C212-200 Turbo Prop, VH-TEM", "Type of survey \tElectromagnetic", "Base of operations \tGeorgetown", "Survey Size (km) \t1138", "Line Direction \tN-S and E-W", "Line Spacing (m) \t300m", "Nominal Aircraft Terrain Clearance (m) \t105", "Nominal Aircraft Speed (m/sec) \t60", "Navigation \tGPS/Doppler", "Field personnel \tPilots \tT McGuire & T Haldane", "Electronics Technician \tT Gree", "Geophysicist/Processor \tS Jaggar", "Of the seven GEOTEM anomalies only one was chosen for drill testing The locations", "of the GEOTEM anomalies and ground EM grids is shown on Plate 6 and 7 while log", "and linear plots are presented in Appendix 5.", "5.5 \tRC and Diamond Drilling", "Two drilling programs were completed within the areas being relinquished. The first", "program consisted of four RC holes (FWP 6-9) testing magnetic anomalies in the", "Frasers Well tenement (Plate 7). The second program consisted of one RC hole to test", "an EM target within the Camerons Prospect.", "In 1992, four ground magnetic sites, within the relinquished area were chosen for drill", "testing. Each site was successfully drill tested and explained. No significant", "mineralisation or alteration was intersected. A summary of the drilling results is", "presented in Table 4. Detailed geological logs and all geochemistry is presented in", "Appendices 6 and 7.", "The Mesozoic sandstone cover varied in thickness from approximately 24 to 71 m and", "consists of unmetamorphosed yellow to white sandstone, pebbly sandstone and", "conglomerate at the base.", "Drill hole cross sections for FWP06 - 09 are presented as Figures 2 to 5.", "In 1994, GEOTEM anomaly 10 at the Camerons prospect was drill tested. A single", "inclined RC hole (PCRC 01) was drilled (96m) to test the main conductive body", "defined by fixed loop EM.", "PCRC-01 intersected 90m (0-90m) of biotite gneiss with minor pegmatite and", "amphibolite throughout, followed by,", "6m (90-96m) of magnetic leucogneiss (Appendix la).", "There was nothing in the hole to explain the EM anomaly SO 32mm PVC pipe was", "installed for future downhole EM work. (See appendix 1a for drill logs).", "Best 6m intercept for PCRC-01:", "6-12m 6m a 33ppm Cu, 51ppm Pb, 179ppm Zn and \t$", "66-72m 6m @ 16ppm Cu, 83ppm Pb, 71 1ppm Zn \t}", "Detailed geological logs and all geochemistry are presented in Appendices 6 and 7", "while the drill hole cross section for PCRC1 is presented in figure 6.", "AEAEC IVAIMII'A TIOVTAETVTR NIVOA VZ TVRd", "2' 'I't'i'?'l'g", "7905956N \t7905995N \t7906034N \t7906073N \t797377E \t797398E \t797419E \t797440E \t740", "740", "AMFB Amphibolite \tPEGM Pegmatite", "AREN Arenite \tPELT Pelite", "BLSH \tBlack Shale \tPSAM Psammite", "CALC Calcrete \tQZIT \tQuartzite \t720 \tCHER Chert \tQZVN \tQuartz Vein \t720", "CLAY \tClaystone \tROCK \tRock Unclassified", "GAQZ Garnet Quartzite \tSAND \tSand", "GNES \tGineiss \tSCHS \tSchist", "GRAN Granite \tSILT \tSiltstone", "GRAV Gravel \tSNST Sandstone", "GRVL Gravel \tSOIL \tSoit", "LOST \tLost Sample \tUCOB \tUnconsolidated Overburden \t700", "700 \tMFRK \tMafic Rock \tVEIN \tVein", "MTSD Meta-Sediments", "LEGEND:", "LITHPAT \tLITH Mag-Sus", "680", "680", "660", "660", "us", "Scale 1 500", "0 \t25 metres", "H V 1", "640", "640", "CR \t7 \t2", "BHP \tExploration BHP Minerals", "SHP Minersis Ply Lid, A.C.N 008 694 78: 694", "EPM 8662 FERN HILL \t620", "797398E \t797419E \t797440E \tDRILL HOLE CROSS SECTION FWP007", "797377E", "7905956N \t7905995N \t7906034N \t7906073N", "Prepared I .Howes \tDate Sept, 1996", "Drawn Techbase \tRevised \tFIGURE 3", "Centre Brisbane \tDrg No. A3-964", "2", "2", "CHE", "00y", "-", "AD", "ISVO", "ISVO", "SaND", "S3N5", "ENOO", "Or", "ONVS", "09o", "-", "ONVS", "Oto", "ONVS", "ND,", "ONVS", "ONOO", "Oo", "ONVS", "ONVS", "I|", "AO", "Lesoflos6", "$98", "e 26 II I II", "88S 88P", "Oe", "Or", "Soon", "0g", "a", "I|| I I", "IIIIIII| 1 ||", "|1", "isly S ': 8 S t $ I,I 'a E E 8 's'", "# AF F # WEV dF # # F", "8", "y", "TABLE 4: RC DRILLING SUMMARY", "Hole No. \tDip-Mag. \tEasting \tNorthing \tTotal \tDown hole \tWater \tGeology of Basement Rocks (mineralogy) \tSusceptibility of", "(Site No.) \tAzimuth \tAMG \tAMG \tDown hole \tDepth to \tTable \tand anomalous geochemistry. \tmagnetic basement", "(Local) \t(Local) \tDepth (m) \tBasement \tDown hole \trocks (CGSx10-)", "(m) \tDepth (m)", "FWP01 \t600->195o \t799775 \t7913100 \t90 \t60 \t89 \tMt-bearing I-Type granite (Qiz-Feld-Bio-Amph-Mt) \t0.1->0.3", "(Site B) \t(10000) \t(4800)", "FWP02 \t60o->225 \t795700 \t7912050 \t102 \t58 \t- \tMeta-sedimentary migmatitic Mt-bearing biotite gneiss (Qtz-Feld- \t0-)0.3", "(Site D) \t(10000) \t(4950 \tBio-Mt). 6m at 261 ppm Zn", "FWP03 \t70o->214 \t799950 \t7906350 \t106 \t37 \t87 \tMeta-sedimentary migmatitic Mt-bearing biotite gneiss (Qtz-Feld- \t0.2->0.4", "(Site G) \t(10000) \t(4500) \tBio-Mt). Narrow bands of magnetic amphibolite/mafic calc-silicate", "(Amph-Feld:Qtz Ep=Mt). \t0.4-0.6", "FWP04 \t65o>214o \t800200 \t7906600 \t102 \t34 \t80 \tFelsic granitic 'leuco-gneiss' (Qiz-FeldBio), \t0.1", "(Site G) \t(10005) \t(4930) \tBiotite Gneiss (Qtz-Feld-Bio), \t0.1-)0.3", "Calc-silicatelamphibolite \t0.3->0.7", "(Feld-Amph-Qtz+Ep:Mt).", "FWP05 \t60o->214o \t800530 \t7906950 \t102 \t28 \t- \tFelsic granitic leuco-gneiss\" \t0-0.2", "(Site G) \t(10000) \t(5300) \t(Qtz-Feldeweathered micas) \t0-5.2", "Calc-silicate gneiss (Qtz-Feld-Amph) \t(av 0.2->1.4)", "FWP06 \t60-016 \t795970 \t7907800 \t96 \t36 \t66 \tMeta-sedimentary migmatitic Mt-bearing biotite gneiss (Qiz-Feld \t0-0.5", "(Site H) \t(10000) \t(4780 \tBioMt), pegmatites (Qtz-Feld-Bio), \t0.5-7.0 \t(av", "Mt-bearing lc-silicatelamphibolite \t0.5-1.0)", "(Qtz-Feld-Amph:eMteBiosEp)", "FWP07 \t60p->028o \t--797400 \t-7906000 \t108 \t35 \t- \tMeta-sedimentary migmatitic biotite gneiss (Qtz-Feld-Bio+Mt), \t0->0.5", "(Site J) \t(10000) \t(4970) \tMt-bearing calc-silicate gneiss (migmatitic) (Qtz-Feld- \t0.1->1.0", "Amph#Bio:MtEp).", "FWP08 \t60-019o \t795000 \t7905435 \t104 \t82 \t- \tMeta-sed. migmatitic biotite Gn (Qiz-Feld-Bio:Mt), \t0.1->0.35 0.1", "(Site K) \t(10000) \t(4945) \tBanded Mig Calc-sil. Gneiss (Qiz Feld-Amph=Ep).", "FWP09 \t60o->035o \t793600 \t7904150 \t102 \t44 \t- \tMeta-sed. migmatitic biotite gneiss (Qtz-Feld-Bio:Mt) \t0.1-1.0", "(Site M) \t(10000) \t(4785) \tImpure Quartzite (Qtz-Feld-Bio-Mt). \t0.3-1.0", "PCRCO1 \t600->082o \t796310 \t7902100 \t96 \t0", "Migmatitic biotite gneiss and magnetite bearing leucogneiss \t0.1-0.2", "- \t6-12m 6m at 51ppm Pb, 179ppm Zn", "66-72m 6m at 83ppm Pb, 71ppm Zn"]}, {"Heading": "6. CONCLUSIONS 10.0", "Content": ["A significant work program was completed within the relinquished areas, including", "regional aeromagnetic and GEOTEM surveys along with infill stream sediment and", "soil sampling, ground magnetics and TEM, followed by RC drilling.", "Drilling of magnetic features under Mesozoic cover has been useful in determining", "the gross structural and stratigraphic setting of the area, namely the continuity of", "folded units of the Einasleigh Metamorphics. However, no alteration or", "mineralisation indicative of a BHT system was intersected.", "Follow-up of all GEOTEM features was completed within the relinquished areas.", "GEOTEM anomaly 10 was the only conductor to be drill tested, although the hole did", "not intersect a conductive source. Weak Pb anomalism was recorded proximal to the", "contact between the biotite gneiss (Pe3) and leucogneiss (Pe,). This is the same", "stratigraphic horizon which hosts the strike extensive Black Soil - Lost Gossan system", "within EPM 9597 (eg McCaughey et al., 1994).", "Elsewhere, ground checking, sampling and geological mapping was completed over", "the GEOTEM anomalies.", "The work program completed within the relinquished areas has located indications of", "BHT mineralisation at the Camerons Prospect (GEOTEM anomalies 10 and 11) as", "well as at GEOTEM anomalies 3-5 (possible extensions of the Black Soil system.", "Small gossanous quartz-gahnite units have also been found at the Smirkies prospect", "and within the Welfern syncline. However, while several interesting areas were", "located, the exploration conducted has been sufficient to preclude the presence of a", "BHP sized Pb-Zn-Ag ore body within the relinquished areas."]}, {"Heading": " REFERENCES 11.0", "Content": ["Charchalis, N. and Duck, B. 1986. Authority to Prospect 4302M Robertson River,", "North Queensland, Six Monthly Report for the period ended 6th December 1986.", "Mount Veteran Minerals Pty Ltd (unpublished Company Report).", "Sandl, I.J. 1984. EPMs 8662, 8688 and 8734 Fernhill, Frasers Well and Percyvale,", "Combined First Annual Report for the period ended 13 February 1993, BHP Minerals", "CR 7749 (unpublished Company Report).", "Withnall, I.W. 1984. Stratigraphy, structure and metamorphism of the Proterozoic", "Etheridge and Langlovale Group, central Georgetowri Inlier, North Queensland,", "Geological Survey of Queensland Record 1984/59 (unpublished).", "McCaughey, S.N, 1995: EPMs 8662, 8688 and 8734. Fernhill, Frasers Well and", "Percyvale Combined third annual report for the period ending 13 February 1995. BHP", "Minerals CR 8350 (unpublished Company Report).", "McCaughey, S.N., McLatchie, G.S. and Scott, R. 1994: EPM9597 BHP Minerals -", "Kidston Joint Venture. Annual report for the period ending 30 September 1994.", "Unpublished CR8334 BHP Minerals Ltd.", "McLatchie, G.S. and Scott, R.L. 1994. EPMs 8662, 8688 and 8734 Fernhill, Frasers", "Well and Percyvale. Combined Second Annual Report for the period ending 13", "February 1994, BHP Minerals CR 7906 (unpublished Company Report).", "Stephens, D. and Paish,K, 1995: EPM 9597 BHP-KIDSTON GOLD MINES joint", "venture. Annua Report for the period ending 30 September 1995. Unpublished", "CR8115 BHP Minerals."]}]